In [1]:
from google.colab import drive # Import 'drive' module from the 'google.colab' library
drive.mount('/content/drive') # This mounts your Google Drive into the Colab virtual environment.

import pandas as pd

file_path = '/content/drive/MyDrive/Titanicdataset.csv' # 'My Drive' refers to the root directory of Google Drive.
df = pd.read_csv(file_path)

print(df.head())

Mounted at /content/drive
   PassengerId  Survived  Pclass  \
0          892         0       3
1          893         1       3
2          894         0       2
3          895         0       3
4          896         1       3

                                           Name     Sex   Age  SibSp  Parch  \
0                              Kelly, Mr. James    male  34.5      0      0
1              Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                     Myles, Mr. Thomas Francis    male  62.0      0      0
3                              Wirz, Mr. Albert    male  27.0      0      0
4  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1

    Ticket     Fare Cabin Embarked
0   330911   7.8292   NaN        Q
1   363272   7.0000   NaN        S
2   240276   9.6875   NaN        Q
3   315154   8.6625   NaN        S
4  3101298  12.2875   NaN        S

In [2]:
# View the last 5 rows
print("\nLast 5 rows of the dataset:")
print(df.tail())

Last 5 rows of the dataset:
     PassengerId  Survived  Pclass                          Name     Sex  \
413         1305         0       3            Spector, Mr. Woolf    male
414         1306         1       1  Oliva y Ocana, Dona. Fermina  female
415         1307         0       3  Saether, Mr. Simon Sivertsen    male
416         1308         0       3           Ware, Mr. Frederick    male
417         1309         0       3      Peter, Master. Michael J    male

      Age  SibSp  Parch              Ticket      Fare Cabin Embarked
413   NaN      0      0           A.5. 3236    8.0500   NaN        S
414  39.0      0      0            PC 17758  108.9000  C105        C
415  38.5      0      0  SOTON/O.Q. 3101262    7.2500   NaN        S
416   NaN      0      0              359309    8.0500   NaN        S
417   NaN      1      1                2668   22.3583   NaN        C

In [3]:
# Get basic information about the dataset (column names, non-null counts, data types)
print("\nBasic Information:")
print(df.info())

Basic Information:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB
None

In [4]:
# Get statistical summary of numerical columns
print("\nStatistical Summary:")
print(df.describe())

Statistical Summary:
       PassengerId    Survived      Pclass         Age       SibSp  \
count   418.000000  418.000000  418.000000  332.000000  418.000000
mean   1100.500000    0.363636    2.265550   30.272590    0.447368
std     120.810458    0.481622    0.841838   14.181209    0.896760
min     892.000000    0.000000    1.000000    0.170000    0.000000
25%     996.250000    0.000000    1.000000   21.000000    0.000000
50%    1100.500000    0.000000    3.000000   27.000000    0.000000
75%    1204.750000    1.000000    3.000000   39.000000    1.000000
max    1309.000000    1.000000    3.000000   76.000000    8.000000

            Parch        Fare
count  418.000000  417.000000
mean     0.392344   35.627188
std      0.981429   55.907576
min      0.000000    0.000000
25%      0.000000    7.895800
50%      0.000000   14.454200
75%      0.000000   31.500000
max      9.000000  512.329200

In [5]:
# Check for missing values in each column
print("Missing values per column:")
print(df.isnull().sum())

# Check total number of missing values in the dataset
print("\nTotal missing values in dataset:", df.isnull().sum().sum())

# --- Handling Missing Values ---

# Example 1: Drop rows with any missing values
df_dropped = df.dropna()
print("\nData after dropping rows with missing values:")
print(df_dropped.shape)

# Example 2: Fill missing values with a specific value (e.g., 0 or 'Unknown')
df_filled = df.fillna(0)  # or use df.fillna('Unknown') for categorical columns
print("\nData after filling missing values with 0:")
print(df_filled.head())

# Example 3: Fill missing values with column mean (for numeric columns)
df_mean_filled = df.fillna(df.mean(numeric_only=True))
print("\nData after filling numeric missing values with column mean:")
print(df_mean_filled.head())

Missing values per column:
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

Total missing values in dataset: 414

Data after dropping rows with missing values:
(87, 12)

Data after filling missing values with 0:
   PassengerId  Survived  Pclass  \
0          892         0       3
1          893         1       3
2          894         0       2
3          895         0       3
4          896         1       3

                                           Name     Sex   Age  SibSp  Parch  \
0                              Kelly, Mr. James    male  34.5      0      0
1              Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                     Myles, Mr. Thomas Francis    male  62.0      0      0
3                              Wirz, Mr. Albert    male  27.0      0      0
4  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1

    Ticket     Fare Cabin Embarked
0   330911   7.8292     0        Q
1   363272   7.0000     0        S
2   240276   9.6875     0        Q
3   315154   8.6625     0        S
4  3101298  12.2875     0        S

Data after filling numeric missing values with column mean:
   PassengerId  Survived  Pclass  \
0          892         0       3
1          893         1       3
2          894         0       2
3          895         0       3
4          896         1       3

                                           Name     Sex   Age  SibSp  Parch  \
0                              Kelly, Mr. James    male  34.5      0      0
1              Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                     Myles, Mr. Thomas Francis    male  62.0      0      0
3                              Wirz, Mr. Albert    male  27.0      0      0
4  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1

    Ticket     Fare Cabin Embarked
0   330911   7.8292   NaN        Q
1   363272   7.0000   NaN        S
2   240276   9.6875   NaN        Q
3   315154   8.6625   NaN        S
4  3101298  12.2875   NaN        S

In [6]:
# --- Handling Missing Values ---

# Example 1: Drop rows with any missing values
df_dropped = df.dropna()
print("\nData after dropping rows with missing values:")
print(df_dropped.shape)

# Example 2: Fill missing values with a specific value (e.g., 0 or 'Unknown')
df_filled = df.fillna(0)  # or use df.fillna('Unknown') for categorical columns
print("\nData after filling missing values with 0:")
print(df_filled.head())

# Example 3: Fill missing values with column mean (for numeric columns)
df_mean_filled = df.fillna(df.mean(numeric_only=True))
print("\nData after filling numeric missing values with column mean:")
print(df_mean_filled.head())

Data after dropping rows with missing values:
(87, 12)

Data after filling missing values with 0:
   PassengerId  Survived  Pclass  \
0          892         0       3
1          893         1       3
2          894         0       2
3          895         0       3
4          896         1       3

                                           Name     Sex   Age  SibSp  Parch  \
0                              Kelly, Mr. James    male  34.5      0      0
1              Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                     Myles, Mr. Thomas Francis    male  62.0      0      0
3                              Wirz, Mr. Albert    male  27.0      0      0
4  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1

    Ticket     Fare Cabin Embarked
0   330911   7.8292     0        Q
1   363272   7.0000     0        S
2   240276   9.6875     0        Q
3   315154   8.6625     0        S
4  3101298  12.2875     0        S

Data after filling numeric missing values with column mean:
   PassengerId  Survived  Pclass  \
0          892         0       3
1          893         1       3
2          894         0       2
3          895         0       3
4          896         1       3

                                           Name     Sex   Age  SibSp  Parch  \
0                              Kelly, Mr. James    male  34.5      0      0
1              Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                     Myles, Mr. Thomas Francis    male  62.0      0      0
3                              Wirz, Mr. Albert    male  27.0      0      0
4  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1

    Ticket     Fare Cabin Embarked
0   330911   7.8292   NaN        Q
1   363272   7.0000   NaN        S
2   240276   9.6875   NaN        Q
3   315154   8.6625   NaN        S
4  3101298  12.2875   NaN        S

In [7]:
# 1. Add 'FamilySize' column
df['FamilySize'] = df['SibSp'] + df['Parch'] + 1  # +1 includes the passenger

# 2. Add 'IsAlone' column (1 if alone, 0 otherwise)
df['IsAlone'] = 0
df.loc[df['FamilySize'] == 1, 'IsAlone'] = 1

# Display first few rows with new columns
print(df[['PassengerId', 'SibSp', 'Parch', 'FamilySize', 'IsAlone']].head())

   PassengerId  SibSp  Parch  FamilySize  IsAlone
0          892      0      0           1        1
1          893      1      0           2        0
2          894      0      0           1        1
3          895      0      0           1        1
4          896      1      1           3        0

In [8]:


# Filter rows where passenger survived (Survived == 1) and gender is female
filtered_df = df[(df['Survived'] == 1) & (df['Sex'] == 'female')]

# Display the first few rows of filtered data
print(filtered_df.head())

    PassengerId  Survived  Pclass  \
1           893         1       3
4           896         1       3
6           898         1       3
8           900         1       3
12          904         1       1

                                             Name     Sex   Age  SibSp  Parch  \
1                Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1
6                            Connolly, Miss. Kate  female  30.0      0      0
8       Abrahim, Mrs. Joseph (Sophie Halaut Easu)  female  18.0      0      0
12  Snyder, Mrs. John Pillsbury (Nelle Stevenson)  female  23.0      1      0

     Ticket     Fare Cabin Embarked  FamilySize  IsAlone
1    363272   7.0000   NaN        S           2        0
4   3101298  12.2875   NaN        S           3        0
6    330972   7.6292   NaN        Q           1        1
8      2657   7.2292   NaN        C           1        1
12    21228  82.2667   B45        S           2        0

In [17]:
from google.colab import drive # Import 'drive' module from the 'google.colab' library
drive.mount('/content/drive') # This mounts your Google Drive into the Colab virtual environment.

import pandas as pd

file_path = '/content/drive/MyDrive/salesdataset.csv' # 'My Drive' refers to the root directory of Google Drive.
# Try reading the CSV with 'latin1' encoding
try:
  df = pd.read_csv(file_path, encoding='latin1')
except UnicodeDecodeError:
  # If 'latin1' fails, you might need to try other encodings like 'ISO-8859-1' or 'cp1252'
  print("UnicodeDecodeError: Could not decode the file with 'latin1' encoding. Try another encoding like 'ISO-8859-1' or 'cp1252'.")
  # As a fallback, you could try reading with a different error handling strategy, but be aware of potential data loss.
  # df = pd.read_csv(file_path, encoding='utf-8', errors='ignore')


print(df.head())

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).
   ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
0      10107.0             30.0      95.70              2.0  2871.00
1      10121.0             34.0      81.35              5.0  2765.90
2      10134.0             41.0      94.74              2.0  3884.34
3      10145.0             45.0      83.26              6.0  3746.70
4      10159.0             49.0     100.00             14.0  5205.27

         ORDERDATE   STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
0   2/24/2003 0:00  Shipped     1.0       2.0   2003.0  ...
1  05/07/2003 0:00  Shipped     2.0       5.0   2003.0  ...
2  07/01/2003 0:00  Shipped     3.0       7.0   2003.0  ...
3   8/25/2003 0:00  Shipped     3.0       8.0   2003.0  ...
4  10/10/2003 0:00  Shipped     4.0      10.0   2003.0  ...

                    ADDRESSLINE1  ADDRESSLINE2           CITY STATE  \
0        897 Long Airport Avenue           NaN            NYC    NY
1             59 rue de l'Abbaye           NaN          Reims   NaN
2  27 rue du Colonel Pierre Avia           NaN          Paris   NaN
3             78934 Hillside Dr.           NaN       Pasadena    CA
4                7734 Strong St.           NaN  San Francisco    CA

  POSTALCODE COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
0      10022     USA       NaN              Yu             Kwai    Small
1      51100  France      EMEA         Henriot             Paul    Small
2      75508  France      EMEA        Da Cunha           Daniel   Medium
3      90003     USA       NaN           Young            Julie   Medium
4        NaN     USA       NaN           Brown            Julie   Medium

[5 rows x 25 columns]

In [19]:
#groupby country and their sales
sales_by_country = df.groupby('COUNTRY')['SALES'].sum()
print(sales_by_country)

COUNTRY
Australia       173712.22
Austria          86231.60
Belgium           9133.59
Canada           55326.33
Denmark          84206.69
Finland          82380.15
France          314843.66
Germany          60822.97
Ireland          16940.26
Italy           112699.21
Japan            57833.19
Norway           99618.61
Philippines      26096.34
Singapore        96204.07
Spain           222953.35
Sweden           70827.00
Switzerland      37301.11
UK              118569.09
USA            1069576.24
Name: SALES, dtype: float64

In [21]:
#average sales by product
avg_sales_by_product = df.groupby('PRODUCTLINE')['SALES'].mean()
print(avg_sales_by_product)

PRODUCTLINE
Classic Cars        4811.235399
Motorcycles         4937.804712
Planes              5362.383462
Trucks and Buses    4321.219518
Vintage Cars        3804.713973
Name: SALES, dtype: float64

In [23]:
#total quantity per year
qty_by_year = df.groupby('YEAR_ID')['QUANTITYORDERED'].sum()
print(qty_by_year)

YEAR_ID
2003.0    7760.0
2004.0    9772.0
2005.0    3765.0
Name: QUANTITYORDERED, dtype: float64

In [25]:
#sales summary by country and year
sales_summary = df.groupby(['COUNTRY', 'YEAR_ID'])['SALES'].agg(['sum', 'mean', 'count'])
print(sales_summary)

                           sum         mean  count
COUNTRY     YEAR_ID
Australia   2003.0    69135.72  4320.982500     16
            2004.0    61143.97  4076.264667     15
            2005.0    43432.53  3948.411818     11
Austria     2003.0    35446.71  5063.815714      7
            2004.0    31165.81  5194.301667      6
            2005.0    19619.08  3269.846667      6
Belgium     2004.0     9133.59  4566.795000      2
Canada      2003.0    21596.03  5399.007500      4
            2004.0    15717.34  3929.335000      4
            2005.0    18012.96  4503.240000      4
Denmark     2003.0    30383.02  6076.604000      5
            2004.0    45448.98  4544.898000     10
            2005.0     8374.69  8374.690000      1
Finland     2003.0    16525.23  4131.307500      4
            2004.0    34541.83  4934.547143      7
            2005.0    31313.09  3479.232222      9
France      2003.0   115129.25  4605.170000     25
            2004.0   156358.11  4467.374571     35
            2005.0    43356.30  4335.630000     10
Germany     2003.0    25369.62  3624.231429      7
            2004.0    35453.35  5064.764286      7
Ireland     2004.0    16940.26  5646.753333      3
Italy       2003.0    39672.13  5667.447143      7
            2004.0    68674.92  4905.351429     14
            2005.0     4352.16  4352.160000      1
Japan       2004.0    46029.69  5114.410000      9
            2005.0    11803.50  5901.750000      2
Norway      2003.0    70579.17  4705.278000     15
            2004.0    29039.44  3629.930000      8
Philippines 2003.0    26096.34  5219.268000      5
Singapore   2003.0    66669.13  6060.830000     11
            2004.0    29534.94  4922.490000      6
Spain       2003.0    78853.99  4380.777222     18
            2004.0    74197.41  4364.553529     17
            2005.0    69901.95  5825.162500     12
Sweden      2003.0    18896.99  6298.996667      3
            2004.0    39772.32  4971.540000      8
            2005.0    12157.69  3039.422500      4
Switzerland 2004.0    37301.11  3730.111000     10
UK          2003.0    41975.47  5246.933750      8
            2004.0    53623.82  3830.272857     14
            2005.0    22969.80  7656.600000      3
USA         2003.0   412603.35  4797.713372     86
            2004.0   482419.08  4683.680388    103
            2005.0   174553.81  4717.670541     37